robbym/llvm-project/llvm/lib/Target/DSPIC/DSPICSubtarget.h
//===-- DSPICSubtarget.h - Define Subtarget for the DSPIC ----*- C++ -*--===//
//
// Part of the LLVM Project, under the Apache License v2.0 with LLVM Exceptions.
// See https://llvm.org/LICENSE.txt for license information.
// SPDX-License-Identifier: Apache-2.0 WITH LLVM-exception
//
//===----------------------------------------------------------------------===//
//
// This file declares the DSPIC specific subclass of TargetSubtargetInfo.
//
//===----------------------------------------------------------------------===//

#ifndef LLVM_LIB_TARGET_DSPIC_DSPICSUBTARGET_H
#define LLVM_LIB_TARGET_DSPIC_DSPICSUBTARGET_H

#include "DSPICFrameLowering.h"
#include "DSPICISelLowering.h"
#include "DSPICInstrInfo.h"
#include "DSPICRegisterInfo.h"
#include "llvm/CodeGen/TargetSubtargetInfo.h"
#include "llvm/IR/DataLayout.h"
#include <string>

#define GET_SUBTARGETINFO_HEADER
#include "DSPICGenSubtargetInfo.inc"

namespace llvm {
class StringRef;

class DSPICSubtarget : public DSPICGenSubtargetInfo {
public:
  enum HWMultEnum {
    NoHWMult, HWMult16, HWMult32, HWMultF5
  };

private:
  virtual void anchor();
  bool ExtendedInsts = false;
  bool LargeCode = false;
  HWMultEnum HWMultMode = NoHWMult;
  DSPICInstrInfo InstrInfo;
  DSPICTargetLowering TLInfo;
  std::unique_ptr<const SelectionDAGTargetInfo> TSInfo;
  DSPICFrameLowering FrameLowering;

public:
  /// This constructor initializes the data members to match that
  /// of the specified triple.
  ///
  DSPICSubtarget(const Triple &TT, const std::string &CPU,
                  const std::string &FS, const TargetMachine &TM);

  ~DSPICSubtarget() override;

  DSPICSubtarget &initializeSubtargetDependencies(StringRef CPU, StringRef FS);

  /// ParseSubtargetFeatures - Parses features string setting specified
  /// subtarget options.  Definition of function is auto generated by tblgen.
  void ParseSubtargetFeatures(StringRef CPU, StringRef TuneCPU, StringRef FS);

  bool isLargeCode() const { return LargeCode; }
  bool hasHWMult16() const { return HWMultMode == HWMult16; }
  bool hasHWMult32() const { return HWMultMode == HWMult32; }
  bool hasHWMultF5() const { return HWMultMode == HWMultF5; }

  const TargetFrameLowering *getFrameLowering() const override {
    return &FrameLowering;
  }
  const DSPICInstrInfo *getInstrInfo() const override { return &InstrInfo; }
  const DSPICRegisterInfo *getRegisterInfo() const override {
    return &getInstrInfo()->getRegisterInfo();
  }

  const DSPICTargetLowering *getTargetLowering() const override {
    return &TLInfo;
  }

  const SelectionDAGTargetInfo *getSelectionDAGInfo() const override;

  void initLibcallLoweringInfo(LibcallLoweringInfo &Info) const override;
};
} // End llvm namespace

#endif  // LLVM_TARGET_DSPIC_SUBTARGET_H
